<template>
	<view class="lg-container">
		<uni-nav-bar left-icon="back" title="用户协议" @clickLeft="onLeftTap"></uni-nav-bar>
		<view class="agreement-container">
			<view class="topBg"></view>
			<view class="bottomBg"></view>
			<view class="agreementBox">
				<view class="agreementBox_top">
					<image class="logo-container" src="/static/mine/logo.png"></image>
				</view>
				<view class="agreementBox_content">
					<text class="lg_p">
						请在点击同意本协议之前，认真阅读本协议并充分理解各条款内容，特别是涉及免除或者限制责任、法律适用和争议解决条款。 如您未满18周岁，或以其他形式被限制民事行为能力，请在监护人的陪同下阅读本协议。
						
						本协议系由杭州云蜂医链科技有限公司（以下简称“本平台”）与所有使用依米云医服务的主体（包括但不限于个人、团队等）（以下简称“用户”）对依米云医的使用及相关服务所订立的有效合约。当用户按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，即表示用户已充分阅读、理解并表示接受本协议的全部条款。本协议适用于任何有关依米云医的服务，包括本协议期限内的用户所使用的各项服务和平台的升级和更新。 阅读本协议的过程中，如果用户不同意本协议或其中任何条款约定，应立即停止注册程序。
						
						
						一、用户及注册
						
						1.依米云医在线提供用户注册。帐号和密码由用户自行保管，用户对以其帐号进行的所有活动和事件负法律责任；
						
						2.用户注册时，在账号名称、头像和简介等注册信息中不得出现违法和不良信息，否则依米云医有权在无需事先通知用户的情况下立即终止向用户提供部分或全部服务。
						
						
						二、服务内容及使用须知
						
						1.依米云医服务的具体内容由依米云医经营者提供，依米云医经营者保留随时变更、中断或终止部分或全部网络服务的权利。
						
						2.依米云医作为医生、患者间交流互通平台，依米云医在此郑重提请您注意，任何经由依米云医服务平台发布的资讯、资料（如：医生答复、医学文章、医疗保健信息等）、文字（如：个人评论、感谢信等）、照片、图形、信息、用户的登记资料或其他资料（以下简称“内容”），均由内容提供者、使用者对其上传、使用行为自行承担责任。 依米云医作为服务平台，无法控制用户发布的内容，也无法对用户的使用行为进行全面控制，因此不能保证内容的合法性、正确性、完整性、真实性或品质；您已预知使用本服务时，可能会接触到令人不快、不适当等内容，并同意将自行加以判断并承担所有风险，而不依赖于依米云医。 依米云医在此提示，若内容中涉及医疗信息，以上信息不能作为病患采取治疗方案的直接依据。如确有必要，应当联系医生进行面对面的诊疗。
						
						3.依米云医在提供网络服务时，可能会对部分服务收取一定费用，依米云医将会对收费服务给予明确的提示，如用户拒绝支付此类费用，依米云医有权不提供相关服务。
						
						4.依米云医仅提供相关的网络服务，除此之外与相关网络服务有关的设备（如个人电脑、手机、及其他与接入互联网或移动网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费）均应由用户自行负担。
						
						5.若用户使用依米云医服务的行为不符合本协议，依米云医在经由通知、举报等途径发现时有权做出独立判断，且有权在无需事先通知用户的情况下立即终止向用户提供部分或全部服务。用户若通过依米云医服务散布和传播反动、色情或其他违反国家法律、法规的信息，依米云医服务的系统记录有可能作为用户违反法律法规的证据；因用户进行上述内容在依米云医服务的上传、传播而导致任何第三方提出索赔要求或衍生的任何损害或损失，由用户自行承担全部责任。
						
						6.依米云医有权对用户使用依米云医网络服务的情况进行监督，如经由通知、举报等途径发现用户在使用依米云医所提供的网络服务时违反任何本协议的规定，依米云医有权要求用户改正或直接采取一切依米云医认为必要的措施（包括但不限于更改或删除用户发布的内容、暂停或终止用户使用网络服务，和/或公示违法或违反本协议约定使用依米云医服务用户账户的权利）以减轻用户不当行为造成的影响。
						
						7.因不可抗力、网络状况、通讯线路、用户自身过错等技术原因，或其他不可控原因导致用户不能正常使用依米云医，依米云医不承担相应责任。
						
						
						三、用户的权利和责任
						
						1.用户有权利拥有自己在依米云医的用户名及密码，并有权利使用自己的用户名及密码随时登陆依米云医，用户在登录后可加入医生创建的医学团队。
						
						2.用户有权利查看加入的医学团队资料及修改个人基本信息，并有权要求在依米云医上所填写的个人信息完全保密。用户不得以任何形式转让或授权他人使用自己的依米云医用户名，亦不得盗用他人帐号，由以上行为造成的后果由用户自行承担。
						
						3.用户有权根据依米云医管理规定发布、获取信息，并在医学团队内以图文方式咨询医生，进行医患互通交流，创建康复记录并对其付费，用户还可享受在医学团队内的拓展服务，包括针对用户疾病的多学科咨询诊断等，具体根据医生发布的服务内容为准。
						
						4.用户必须遵守卫生部《互联网医疗保健信息服务管理办法》及国家关于互联网信息发布的相关法律法规，用户对自己在依米云医上发布的信息承担责任，不得发布违法信息，不得恶意评价其他用户。用户承诺自己在使用依米云医时实施的所有行为均遵守国家法律、法规和依米云医管理规定以及社会公共利益和道德。如用户违反上述任一规则，导致相应法律后果的发生，用户以自己的名义独立承担所有法律责任。
						
						5.用户不得将涉及医疗纠纷的问题或其它有责任争议的问题在依米云医发布，关于医疗纠纷的问题，请另行咨询律师或相关主管部门寻求援助，依米云医有权将此类信息删除。依米云医作为网络平台，只提供沟通渠道的服务，不涉及一切医疗活动。医疗纠纷属于病患以及医疗机构之间的纠纷，与依米云医没有任何关系。
						
						6.若发现其他用户有违法或违反依米云医管理规定的行为，用户可以进行反映要求处理。您因依米云医展示的内容与其他用户发生纠纷的，司法部门可以要求依米云医根据法律程序提供该案件所需证据材料。
						
						
						四、依米云医的权利和责任
						
						1.依米云医将协助医患之间进行合法的交流，并提供必要的网络技术帮助；
						
						2.依米云医有义务在现有技术上维护整个网络平台的正常运行，并努力提升和改进技术，使医患之间的网上交流、互助得以顺利进行；
						
						3.依米云医作为医患互通服务的平台，不对用户发布的信息的来源和正确性负责，不参与医患交流，不对医患交流的结果承担任何责任；
						
						4.对于用户在依米云医上的不当行为或其它任何依米云医认为应当终止服务的情况，有权随时作出删除相关信息、终止服务提供等处理，而无需征得用户同意；
						
						5.依米云医没有义务对所有用户的注册数据、所有的活动行为以及与之有关的其它事项进行审查，但如存在下列情况，依米云医有权根据不同情况选择保留或删除相关信息或继续、停止对该用户提供服务，并追究相关法律责任：
						
						a.用户或其它第三方通知依米云医，认为某个具体用户、具体行为、具体事项可能存在重大问题（包括但不限于严重失实、涉及侵权、敏感内容等）；
						
						b.用户或其它第三方向依米云医告知网络平台上内容有违法或不当行为的，依米云医以普通非专业人员的知识水平标准对相关内容进行判别，可以明显认为这些内容或行为具有违法或不当性质的；
						
						c.其他有可能违反相关法律法规或依米云医管理规定的行为。
						
						6.依米云医有权对用户的注册数据及活动行为进行查阅，发现注册数据或活动行为中存在任何问题或怀疑，均有权向用户发出询问及要求改正的通知或者直接作出删除等处理；
						
						7.许可使用权：用户以此授予依米云医独家的、全球通用的、永久的、免费的许可使用权利，使依米云医有权(全部或部分) 使用、复制、修订、改写、发布、翻译、分发、执行和展示用户公示于网站的各类信息或制作其派生作品，和/或以现在已知或日后开发的任何形式、媒体或技术，将上述信息纳入其它作品内。
						
						
						五、隐私保护
						
						1.适用范围
						
						a.您注册依米云医时，根据网站要求提供的个人信息；
						
						b.您使用依米云医服务、参加相关活动、访问微信服务号（或手机移动端）时，网站自动接收并记录用户浏览器上的服务器数据，包括但不限于IP地址、网站Cookie中的资料及用户要求取用的网页记录；
						
						c.用户使用依米云医时，上传的非公开的文字、图片、数据信息（包括但不限于病历资料、基本情况、诊疗方案等）；
						
						d.依米云医通过合法途径从其他途径取得的用户个人资料；
						
						e.用户认为不宜公开的其他内容。
						
						2.信息保密
						
						a.依米云医保证不对外公开或向第三方提供用户的注册资料及用户在使用网络服务时存储的非公开内容，但下列情况除外：
						
						i.事先获得您的明确授权的；
						
						ii.根据有关的法律法规要求的；
						
						iii.按照相关政府主管部门的要求的；
						
						iv.为维护社会公众的利益的；
						
						v.为维护依米云医的合法权益。
						
						b.依米云医可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与依米云医同等的保护用户隐私的责任，则依米云医有权将用户的注册资料等提供给该第三方。
						
						3.信息使用
						
						a.在不透露用户的保密信息的前提下，依米云医有权对整个用户数据库进行分析并对用户数据库进行商业上的利用；
						
						b.为服务用户的目的，依米云医可能通过使用用户个人信息向您提供服务，包括但不限于向用户发出活动和服务信息等。
						
						
						六、免责声明
						
						1.鉴于网络服务的特殊性，用户同意依米云医服务有权随时变更、中断或终止部分或全部的网络服务。如变更、中断或终止的网络服务属于免费网络服务，依米云医服务无需通知用户，也无需对任何用户或任何第三方承担任何责任。
						
						2.依米云医需要定期或不定期地对提供网络服务的平台或相关的设备进行检修或者维护，如因此类情况而造成需收费网络服务在合理时间内的中断，依米云医无需为此承担任何责任，但依米云医应尽可能事先进行通告。
						
						3.依米云医可在任何时候为任何原因变更网络服务或删除其部分功能。依米云医可在任何时候取消或终止对用户的服务。依米云医取消或终止服务的决定不需要理由或通知用户。一旦服务取消，用户使用网络服务的权利立即终止。一旦依米云医服务取消或终止，用户在依米云医服务中储存的任何信息可能无法恢复。
						
						4.依米云医服务不保证（包括但不限于）：
						
						a.依米云医适合用户的使用要求；
						
						b.依米云医不受干扰，及时、安全、可靠或不出现错误；及用户经由依米云医服务取得的任何产品、服务或其他材料符合用户的期望。
						
						c.用户使用经依米云医服务下载或取得的任何资料（包括但不限于医疗经验、诊疗方案等），其风险由用户自行承担；因该等使用导致用户电脑系统损坏或资料流失，用户应自己负完全责任；
						
						5.基于以下原因而造成的利润、商业信誉、资料损失或其他有形或无形损失，依米云医服务不承担任何直接、间接的赔偿：
						
						a.对依米云医的使用或无法使用
						
						b.经由依米云医购买或取得的任何产品、资料或服务；
						
						c.用户资料遭到未授权的使用或修改；及其他与依米云医相关的事宜。
						
						
						七、其他
						
						1.本协议最终解释权归依米云医所有。
						
						2.本协议一经公布即生效，依米云医有权随时对协议内容进行修改，修改后的结果公布于依米云医平台上。如果不同意依米云医对本协议相关条款所做的修改，用户有权停止使用网络服务。如果用户继续使用网络服务，则视为用户接受依米云医对本协议相关条款所做的修改。
						
						3.本协议项下依米云医对于用户所有的通知均可通过网页公告、电子邮件、手机短信或常规的信件传送等方式进行；该等通知于发送之日视为已送达收件人。
						
						4.本协议的订立、执行和解释及争议的解决均应适用中国法律并受中国法院管辖。如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向依米云医所在地的人民法院提起诉讼。
						
						5.本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议规定的之外，未赋予本协议各方其他权利。
						
						6.如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。。
																		
					</text>
					<br>
					<br>
					<br>
				</view>
			</view>
			<view class="agreementBox_bottom">
				<image class="bg-img" src="/static/system/bg.png"></image>
			</view>
		</view>
	</view>
</template>

<script>
	export default {
		methods: {
			onLeftTap() {
				uni.navigateBack({ delta: 1 });
			}
		}
	}
</script>

<style lang="scss" scoped>
	.lg-container {
		.agreement-container {
			position: relative;
			height: calc(100% - 88rpx);
			// #ifndef H5
			height: calc(100vh - 136rpx);
			// #endif
			.topBg {
				height: 80rpx;
				background: linear-gradient(-90deg, rgb(92, 204, 205), rgb(3, 169, 172))
			}
			.bottomBg {
				width: 716rpx;
				height: 216rpx;
				position: fixed;
				bottom: 18rpx;
				left: 50%;
				transform: translateX(-50%);
				background: #03A9AC;
			}
			.agreementBox {
				width: 670rpx;
				height: calc(100% - 40rpx);
				background-color: #fff;
				position: absolute;
				top: 0;
				left: 50%;
				transform: translateX(-50%);
				.agreementBox_top {
					height: 150rpx;
					display: flex;
					justify-content: center;
					align-items: center;
					border-bottom: 2rpx solid rgba(205, 238, 238, .4);
					.logo-container {
						width: 252rpx;
						height: 74rpx;
					}
				}
				.agreementBox_content {
					height: calc(100% - 150rpx);
					overflow: auto;
					padding: 50rpx;
					color: #373636;
					font-size: 26rpx;
					line-height: 52rpx;
					box-sizing: border-box;
				}
			}
			.agreementBox_bottom {
				height: 251rpx;
				width: 100vw;
				position: fixed;
				bottom: 8rpx;
				right: 6rpx;
				.bg-img {
					width: 100%;
					height: 100%;
				}
			}
		}
	}
</style>
